package com.example.homework2

class ConvertNumberToNames {

    private val units = arrayOf(
        "ნული", "ერთი", "ორი", "სამი", "ოთხი",
        "ხუთი", "ექვსი", "შვიდი", "რვა", "ცხრა", "ათი", "თერთმეტი", "თორმეტი",
        "ცამეტი", "თოთხმეტი", "თხუთმეტი", "თექვსმეტი", "ჩვიდმეტი",
        "თვრამეტი", "ცხრამეტი"
    )

    private val tens = arrayOf(
        "", "", "ოცდა", "ოცდა", "ორმოცდა", "ორმოცდა", "სამოცდა", "სამოცდა", "ოთხმოცდა", "ოთხმოცდა",
        "ოცი", "ოცდაათი", "ორმოცი", "ორმოცდაათი", "სამოცი", "სამოცდაათი", "ოთხმოცი", "ოთხმოცდაათი"
    )

    private val hundreds = arrayOf(
        "","ას", "ორას", "სამას", "ოთხას", "ხუთას", "ექვსას", "შვიდას", "რვაას", "ცხრაას",
        "ასი", "ორასი", "სამასი", "ოთხასი", "ხუთასი", "ექვსასი", "შვიდასი", "რვაასი", "ცხრაასი"
    )

    fun convert(n: Int): String {
        if (n < 0) {
            return "მინუს " + convert(-n)
        }
        if (n < 20) {
            return units[n]
        }
        if(n in 20..99 && n % 10 == 0){
            return tens[(n / 10) + 8]
        }
        if (n < 100) {
            return tens[n / 10] + units[n % 20]
        }
        if( n < 1000 && n % 100 == 0){
            return hundreds[(n / 100) + 9]
        }
        return if (n < 1000) {
            hundreds[n / 100]  + " " + convert(n % 100)
        }else{
            "არასწორი ციფრი!!!"
        }
    }
}